PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm.h
            TCPWM_GRP_CNT_TR_IN_SEL1(base, grp, cntNum) |= _VAL2FLD(TCPWM_GRP_CNT_V2_TR_IN_SEL1_CAPTURE1_SEL, triggerSignal);
            TCPWM_GRP_CNT_TR_IN_EDGE_SEL(base, grp, cntNum) |= _VAL2FLD(TCPWM_GRP_CNT_V2_TR_IN_EDGE_SEL_CAPTURE1_EDGE, edgeSelect);
        }
#if (CY_TCPWM_CC1_RUNTIME_CHECK)
        else
        {
            /* Capture 1 - Not supported for the group */
            CY_ASSERT_L3(false);
        }
#endif
        break;
    default:
        /* Not a valid input trigger */
        CY_ASSERT_L3(false);
        break;
    }

}


/*******************************************************************************
* Function Name: Cy_TCPWM_OutputTriggerSetup
****************************************************************************//**
*
* Sets up a trigger output signal for a specific TCPWM counter event.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param trigger0event
* Selects internal events for output trigger out0 generation. see \ref cy_en_tcpwm_output_trigselect_t
*
* \param trigger1event
* Selects internal events for output trigger out1 generation. see \ref cy_en_tcpwm_output_trigselect_t
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_OutputTriggerSetup(TCPWM_Type *base, uint32 cntNum, cy_en_tcpwm_output_trigselect_t trigger0event, cy_en_tcpwm_output_trigselect_t trigger1event)
{
    uint32_t grp = TCPWM_GRP_CNT_GET_GRP(cntNum);

    TCPWM_GRP_CNT_TR_OUT_SEL(base, grp, cntNum) =
        (_VAL2FLD(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT0, trigger0event) |
         _VAL2FLD(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT1, trigger1event));

}

/*******************************************************************************
* Function Name: Cy_TCPWM_SetDebugFreeze
****************************************************************************//**
*
* Enables/disables the Debug Freeze feature for the specified counter.
*
* \note This feature will work correctly when the trigger type parameter in
* \ref Cy_TrigMux_Connect will be set to 'TRIGGER_TYPE_LEVEL'.
* The example is in the code snippet for this API.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param enable
* true: The Debug Free feature is enabled
* false: The Debug Freeze feature is disabled
*
* \return
* Error / Status code. See cy_en_tcpwm_status_t.
*
* \funcusage
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_SetDebugFreeze
*
*******************************************************************************/
__STATIC_INLINE cy_en_tcpwm_status_t Cy_TCPWM_SetDebugFreeze(TCPWM_Type *base, uint32 cntNum, bool enable)
{
    CY_REG32_CLR_SET(TCPWM_GRP_CNT_CTRL(base, TCPWM_GRP_CNT_GET_GRP(cntNum), cntNum), TCPWM_GRP_CNT_V2_CTRL_DBG_FREEZE_EN, enable);
    return CY_TCPWM_SUCCESS;
}
#endif


/** \} group_tcpwm_functions_common */

/** \} group_tcpwm_common */

/*******************************************************************************
* Backward compatibility macro. The following code is DEPRECATED and must
* not be used in new projects
*******************************************************************************/
#define CY_TCPWM_INT_ON_CC              CY_TCPWM_INT_ON_CC0
#define CY_TCPWM_INT_ON_CC_OR_TC        CY_TCPWM_INT_ON_CC0_OR_TC

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXTCPWM */

#endif /* CY_TCPWM_H */

/* [] END OF FILE */
